{
  "source_file": "COS40005 Team and Project Plan__1761763483743.docx",
  "tables": {
    "TeamContributions": {
      "include_in_metrics": true,
      "rows": [
        {
          "Student Name": "Connor Lack",
          "Student Id": "103992223",
          "Description of contribution in team and project planning": "Teamwork Roadmap\nDocument Management\nRisk Mitigation\nProblem Statement \nScope"
        },
        {
          "Student Name": "Jen Mao",
          "Student Id": "103821194",
          "Description of contribution in team and project planning": "Quality Plan"
        },
        {
          "Student Name": "Jason Vo",
          "Student Id": "103993653",
          "Description of contribution in team and project planning": "Solution Approach"
        },
        {
          "Student Name": "Kavindu Bhanuka Weragoda",
          "Student Id": "104860525",
          "Description of contribution in team and project planning": "Stakeholder\nHigh-level requirements"
        },
        {
          "Student Name": "Md Hridoy Mia",
          "Student Id": "105077229",
          "Description of contribution in team and project planning": "Product Backlog"
        }
      ]
    },
    "TeamProfile": {
      "include_in_metrics": false,
      "rows": [
        {
          "Student name": "Connor Lack",
          "Technical skills": "Adequate in Python and C#. Experience with machine learning in relation to cleaning and using datasets.",
          "Soft skills": "Organized, Experience with sprints and project planning.",
          "Communication": "More introverted but will speak up when necessary. English first language. Comfortable with text or speech.",
          "Teamwork": "Usually the listener, I take into consideration all team-members opinions and ideas before responding and formulating a plan."
        },
        {
          "Student name": "Jen Mao",
          "Technical skills": "Proficient in Python and C#. Experienced in front-end (HTML, CSS, JavaScript).",
          "Soft skills": "Ability to solve problems, adaptive, open to new learning, good at time management.",
          "Communication": "Kinda introverted but will try to communicate. Can speak English. Able to communicate online or in person if informed in advance.",
          "Teamwork": "Good at listening, responsive in group chats, collaborative, supportive."
        },
        {
          "Student name": "Jason Vo",
          "Technical skills": "Sufficient in Python, C++, HTML, CSS, PHP. Some experience with Java, Node.js",
          "Soft skills": "Eagerness to learn, collaborating within a team, communicating authentic thoughts to the team",
          "Communication": "Able to communicate online or in person, may have long response time during working hours",
          "Teamwork": "Within a team, I will proactively listen to and respect my colleagues as well as express any thoughts and ideas I may have. I will try my best to meet deadlines and balance the team's needs with outside commitments."
        },
        {
          "Student name": "Kavindu Bhanuka Weragoda",
          "Technical skills": "Good knowledge on c++. Skilled in HTML,CSS, and Java (not professional level).Fairly good at  of python",
          "Soft skills": "Reliable,able to manage time effectively, and\ncommitted to completing tasks within\ndeadlines.",
          "Communication": "English is not first language but able to\ncommunicate and write well in academic/\nprofessional contexts.",
          "Teamwork": "Experienced working in teams; cooperative\nand adaptable with others, even while\nbalancing other commitments."
        },
        {
          "Student name": "Md Hridoy Mia",
          "Technical skills": "Good knowledge on c++. Skilled in HTML,CSS,PHP and Java.",
          "Soft skills": "Prioritizing tasks effectively.\nMeeting deadlines consistently.\nBalancing multiple responsibilities.",
          "Communication": "English is not my first but I am capable of effectively communicating and writing .",
          "Teamwork": "I believe teamwork is one of my strongest soft skills. I work well with others by listening to their ideas, respecting different perspectives, and contributing my own thoughts to reach a common goal."
        }
      ]
    },
    "TeamRole": {
      "include_in_metrics": false,
      "rows": [
        {
          "Student name": "Connor Lack",
          "Team role": "Team Leader \nResearch\nBack End",
          "Justification": "I’m comfortable with organizing tasks and making sure deadlines are met, able to make sure that everyone has an opinion during decision making. I’m also happy to work on developing the backend of the project, which will involve implementation of rule-based and AI driven analysis of project artifacts - which are uploaded, collected, and analysed."
        },
        {
          "Student name": "Jen Mao",
          "Team role": "Front End",
          "Justification": ""
        },
        {
          "Student name": "Jason Vo",
          "Team role": "Scrum Master\nResearch\nBack End",
          "Justification": "I’m able to work together with my colleagues to establish frequent and clear dialogue, so that we stay on track and deadlines are met. I am also interested in contributing to the major research needed to achieve this project and implementing a solution."
        },
        {
          "Student name": "Kavindu Bhanuka Weragoda",
          "Team role": "Front End \nUX/UI designer",
          "Justification": "I am confident in myself contributing towards the front end development of our project since I major in software development and have a keen interest in front end development myself. Also i am attempting advance web development makes me strengthen my capabilities in this area"
        },
        {
          "Student name": "Md Hridoy Mia",
          "Team role": "Back End",
          "Justification": "As a Data Science major working as a back-end developer, I understand the importance of teamwork in delivering successful projects. I always communicate clearly, complete my tasks on time, and adapt to the team’s needs. By sharing ideas and solving problems together, I contribute to building reliable back-end solutions that support the overall success of the project."
        }
      ]
    }
  },
  "students": {
    "Connor Lack": {
      "sections_written": [
        "Teamwork roadmap",
        "Document management",
        "Problem at hand",
        "Scope"
      ],
      "relevant_tables": [
        "RiskMitigation"
      ],
      "raw_text": "The team agreed upon two weekly meetings, with the time slots Monday 8:30pm and Saturday 11:00am fitting our schedules best. The team meetings will be conducted predominately on Discord. We came to the decision that discord will be our main informal communication platform. This will allow for files to be shared easily and for relevant information or announcements to be shared by all team members, as discord is also a very optimised application on smartphones - allowing all members to communicate even when they’re not on their laptops / desktops. Microsoft Teams will be used as the platform for formal communication between the team, our supervisor, and the client.\nThe expected response time between team members in regards to messages is within a few hours, as it’s likely team-members have casual employment or classes during the day. As stated prior, Discord is also an application on smartphones, so notifications for the team server shall always be on. This will improve response time and communication effectiveness between members. In terms of timeliness in regards to attending team meetings, all members are expected to show respect for their team-member’s and client’s time, being ready to join the meeting at the scheduled timeslot. If team-members fail to join a scheduled meeting without prior notice, it will be noted and discussed within the team. If the absences continue to occur without communication, and the team progress is negatively affected, then a supervisor will be contacted and the team-member will be reported. But, if a team-member gives a reasonable heads up that they will be unable to attend, their absence will be excused, and notes will be uploaded and shared with the absent member.\nThe team aims to complete weekly team submissions 3-4 days prior to their due-date to avoid cramming and submitting work that doesn’t reflect our full potential. The 3-4 day period between completion and submission will allow for daily revisions for the team to revise and review their own and other member’s individually written segments - allowing for constructive criticism and room for each member to voice their opinions. Destructive criticism will not be tolerated, we are all on the same team with the goal of helping one another and not tearing each other down.\nTasks will be assigned to team-members with the technical skills and team role suitable to take it on. Tasks will have different estimations on their completion date depending on the context of the task, its importance, and the size it’s estimated to be. Such as written documentation segments are easier and will require less time to complete in comparison to the implementation of a rule-based AI driven analysis. Team member task information and deadlines will be monitored using Trello. Trello will provide a visual board where tasks can be created, assigned, and tracked across different stages of development. Vital to tracking our sprint progress, Trello also includes checklists and due-dates which will make it easier for team-members to see progress and plan their work/life balance. If tasks end up falling behind, the team-member responsible should raise it as early as possible so deadlines can be altered or extended as a team.\nAll written documentation files are stored on a Google Drive which all team-members have access to. Google Drive was selected as all team-members can access it from any device, and it supports real-time collaboration - allowing all members of the team to work on a single document at the same time without requiring the document to be pushed or pulled to a repo. Document version history is also available for all Google documentation, which allows for us to keep track of which team-member contributed and when.\n\nShared documents will be stored on a Google Drive, which all team members have access to. Google Docs grants the ability to see changes to documents and observe the document version history, which displays information in regards to team-member contributions, changes on specific dates, and restoration to earlier versions of the file if necessary. This will provide clear accountability and version control.\n\nTo individually assess a large variety of student’s contributions in a group project can be very time consuming and difficult to mark. Our objective is to create a tool that assessors can use to aid them in their marking process by using or trialing various technologies such as AI, LLM’s, NLP’s and/or others to analyse quality of code, importance of code, peer reviews, supervisor reviews, contribution towards documentation, etc.\n\nThe project will focus on the development of an AI tool that helps unit lecturers and tutors assess the individual contribution of a team-member throughout a group project. The main goal is to reduce the time that is typically spent to go through all the submitted project artifacts and rid potential biased marking. Typical project artifacts include commits, worklogs, code quality, documentation, sprint reports, and peer reviews. Non-technical contributions such as documentation and planning shall also be factored in.",
      "metrics": {
        "word_count": 914,
        "avg_sentence_length": 26.88,
        "sentence_complexity": 1.853,
        "readability_score": 39.61
      }
    },
    "Jen Mao": {
      "sections_written": [
        "Quality plan"
      ],
      "relevant_tables": [],
      "raw_text": "The quality plan ensures that the deliverables of this project meet the technical, functional, and academic expectations outlined by the supervisor and client",
      "metrics": {
        "word_count": 25,
        "avg_sentence_length": 25.0,
        "sentence_complexity": 2.0,
        "readability_score": 17.97
      }
    },
    "Jason Vo": {
      "sections_written": [],
      "relevant_tables": [],
      "raw_text": "",
      "metrics": {
        "word_count": 0,
        "avg_sentence_length": 0,
        "sentence_complexity": 0,
        "readability_score": 0
      }
    },
    "Kavindu Bhanuka Weragoda": {
      "sections_written": [
        "High-level requirements"
      ],
      "relevant_tables": [
        "HighLevelRequirements"
      ],
      "raw_text": "The proposed system is a new prototype web application design to support lecturers and tutors in fairly assessing individual contributions within student group projects. It is not an upgrade or replacement of an existing system.\nInitially, the system will operate as a rule-based prototype, aggregating structured data (commits, worklogs, meeting attendance) through manual uploads. In the long term, the project may incorporate Al/NLP models to analyze unstructured data (documentation, sprint reports, peer reviews).  The system is not part of a larger platform but can be extended in the future to integrate with third-party tools (e.g., GitHub, Trello, Canvas).",
      "metrics": {
        "word_count": 119,
        "avg_sentence_length": 23.8,
        "sentence_complexity": 0.8,
        "readability_score": 35.73
      }
    },
    "Md Hridoy Mia": {
      "sections_written": [
        "Product backlog"
      ],
      "relevant_tables": [
        "ProductBacklog"
      ],
      "raw_text": "The product backlog includes all the features and tasks required to develop the Contribution Assessment prototype for Team Projects. The items are prioritized according to their value, interdependencies, and considerations for sprint planning.\nAlpha Release (Semester 1): PB1–PB4, PB9, PB10 (core upload, metrics, comparison, privacy, testing)\nBeta Release (Semester 2): PB5–PB8 (timeline, permissions, exports, recommendations)",
      "metrics": {
        "word_count": 78,
        "avg_sentence_length": 26.0,
        "sentence_complexity": 0.667,
        "readability_score": 12.87
      }
    }
  },
  "overall_metrics": {
    "word_count": 3078,
    "avg_sentence_length": 25.02,
    "sentence_complexity": 1.325,
    "readability_score": 32.33
  }
}